public/programming/gists/misc/hello_world.asm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org35f0c4e" class="outline-2">
<h2 id="org35f0c4e">Misc / hello_world.asm</h2>
<div class="outline-text-2" id="text-org35f0c4e">
<p>
Hello world x86-64 Linux assembly example.
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #989898;">;; </span><span style="color: #989898;">SPDX-License-Identifier: MIT
</span><span style="color: #989898;">;; </span><span style="color: #989898;">Author: Giovanni Santini
</span><span style="color: #989898;">;; </span><span style="color: #989898;">Github: @San7o
</span>
<span style="color: #feacd0;">extern</span> <span style="color: #b6a0ff;">printf</span>

  <span style="color: #b6a0ff;">SECTION</span> .data
<span style="color: #feacd0;">fmt</span>:
  <span style="color: #b6a0ff;">db</span> <span style="color: #79a8ff;">"Hello!"</span>, 10, 0

  <span style="color: #b6a0ff;">SECTION</span> .text
  <span style="color: #b6a0ff;">global</span> main

<span style="color: #feacd0;">main</span>:
  <span style="color: #989898;">;; </span><span style="color: #989898;">align stack: call pushes return addr (8 bytes),
</span>  <span style="color: #989898;">;; </span><span style="color: #989898;">so subtract 8 more to make 16-byte alignment
</span>  <span style="color: #b6a0ff;">sub</span> rsp, 8

  <span style="color: #b6a0ff;">lea</span> rdi, [rel fmt]            <span style="color: #989898;">; </span><span style="color: #989898;">first arg
</span>  <span style="color: #b6a0ff;">xor</span> eax, eax                  <span style="color: #989898;">; </span><span style="color: #989898;">set AL=0 for 0 varargs
</span>  <span style="color: #b6a0ff;">call</span> printf

  <span style="color: #b6a0ff;">add</span> rsp, 8                    <span style="color: #989898;">; </span><span style="color: #989898;">restore stack
</span>  <span style="color: #b6a0ff;">mov</span> rax, 0                    <span style="color: #989898;">; </span><span style="color: #989898;">return number
</span>  <span style="color: #b6a0ff;">ret</span>
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
